aks3g/ai_mini_4wd_kit/src/library/include/samd51_sdhc.h
/*
 * samd51_sdhc.h
 *
 * Created: 2019/03/10
 * Copyright © 2019 Kiyotaka Akasaka. All rights reserved.
 */ 

#ifndef SAMD51_SDHC_H_
#define SAMD51_SDHC_H_

#include <stddef.h>

#pragma pack(1)
typedef union SAMD51_SDHC_CMD_t{
	uint16_t word;
	struct {
		uint16_t response_type_select : 2;
		uint16_t rsvd : 1;
		uint16_t command_crc_checl_enable : 1;
		uint16_t command_index_check_enable : 1;
		uint16_t data_present_select : 1;
		uint16_t command_type : 2;
		uint16_t command_index : 6;
		uint16_t reserved : 2;
	} bm;
} SAMD51_SDHC_CMD;

#pragma pack(1)
typedef struct SdHostControllerRegs_t
{
	uint32_t sdma_system_address_argument2;
//	uint16_t block_size;
	union {
		uint16_t word;
		struct {
			uint16_t transfer_block_size : 12;
			uint16_t host_sdma_buffer_boundary : 3;
			uint16_t reserved : 1;
		} bm;
	} block_size;
	uint16_t block_count;
	uint32_t argument1;
//	uint16_t transfer_mode;
	union {
		uint16_t word;
		struct {
			uint16_t dma_enable : 1;
			uint16_t block_count_enable : 1;
			uint16_t auto_command_enable : 2;
			uint16_t data_transfer_direction_select : 1;
			uint16_t multi_single_block_select : 1;
			uint16_t reserved : 10;
		} bm;
	} transfer_mode;
	SAMD51_SDHC_CMD command;
	uint32_t response[4]; //128bit
	uint32_t buffer_data_port;
//	uint32_t present_state;
	union {
		uint32_t dword;
		struct {
			uint32_t command_inhibit_cmd : 1;
			uint32_t command_inhibit_dat : 1;
			uint32_t dat_line_active : 1;
			uint32_t re_tuning_request : 1;
			uint32_t rsvd : 4;
			uint32_t write_transfer_active : 1;
			uint32_t read_transfer_active : 1;
			uint32_t buffer_write_enable : 1;
			uint32_t buffer_read_enable :1;
			uint32_t rsvd2 : 4;
			uint32_t card_inserted : 1;
			uint32_t card_state_stable : 1;
			uint32_t card_detect_pin_level : 1;
			uint32_t write_protected_switch_pin_l_level : 1;
			uint32_t dat_line_signal_level : 4;
			uint32_t cmd_line_signal_level : 1;
			uint32_t rsvd3 : 7;
		} bm;
	} present_state;
//	uint8_t  host_control1;
	union {
		uint8_t byte;
		struct {
			uint8_t led_control : 1;
			uint8_t data_transfer_width : 1;
			uint8_t high_speed_enable : 1;
			uint8_t dma_select : 2;
			uint8_t extended_data_transfer_width : 1;
			uint8_t card_detect_test_level : 1;
			uint8_t card_detect_signal_seelction : 1;
			
		} bm;
	} host_control1;
//	uint8_t  power_control;
	union {
		uint8_t byte;
		struct {
			uint8_t sd_bus_power : 1;
			uint8_t sd_bus_voltage_select : 3;
			uint8_t rsvd : 4;
		} bm;
	} power_control;
//	uint8_t  block_gap_contorl;
	union {
		uint8_t byte;
		struct {
			uint8_t stop_at_block_gap_request : 1;
			uint8_t continue_request : 1;
			uint8_t read_wait_control : 1;
			uint8_t interrupt_at_block_gap : 1;
			uint8_t rsvd : 4;
		} bm;
	} block_gap_contorl;
//	uint8_t  wakeup_control;
	union {
		uint8_t byte;
		struct {
			uint8_t wakeup_event_enable_on_sd_card_interrupt : 1;
			uint8_t wakeup_event_enable_on_sd_card_insertion : 1;
			uint8_t wakeup_event_enable_on_sd_card_removal : 1;
			uint8_t rsvd : 5;
		} bm;
	} wakeup_control;
//	uint16_t clock_control;
	union {
		uint16_t word;
		struct {
			uint16_t internal_clock_enable : 1;
			uint16_t internal_clock_stable : 1;
			uint16_t sd_clock_enable : 1;
			uint16_t reserved : 2; 
			uint16_t clock_generator_select : 1;
			uint16_t upper_bias_of_sdclk_frequency_select : 2;
			uint16_t sdclk_frequency_select : 8;
		} bm;
	}clock_control;
	uint8_t  timeout_control;
//	uint8_t  software_reset;
	union{
		uint8_t byte;
		struct {
			uint8_t software_reset_for_all : 1;
			uint8_t software_reset_for_cmd_line : 1;
			uint8_t software_reset_for_dat_line : 1;
			uint8_t rsvd : 5;
		} bm;
	} software_reset;
//	uint16_t normal_interrupt_status;
	union{
		uint16_t word;
		struct {
			uint16_t command_complete : 1;
			uint16_t transfer_complete : 1;
			uint16_t block_gap_event : 1;
			uint16_t dma_interrupt : 1;
			uint16_t buffer_write_ready : 1;
			uint16_t buffer_read_ready : 1;
			uint16_t card_insertion : 1;
			uint16_t card_removeal : 1;
			uint16_t card_interrupt : 1;
			uint16_t int_a : 1;
			uint16_t int_b : 1;
			uint16_t int_c : 1;
			uint16_t re_turning_event : 1;
			uint16_t rsvd : 2;
			uint16_t error_interrupt : 1;
		} bm;
	} normal_interrupt_status;
//	uint16_t error_interrupt_status;
	union{
		uint16_t word;
		struct {
			uint16_t command_timeout_error : 1;
			uint16_t command_crc_error : 1;
			uint16_t command_end_bit_error : 1;
			uint16_t command_index_error : 1;
			uint16_t data_timeout_error : 1;
			uint16_t data_crc_error : 1;
			uint16_t data_end_bit_error : 1;
			uint16_t current_limit_error : 1;
			uint16_t auto_cmd12_error : 1;
			uint16_t adma_error : 1;
			uint16_t tuning_error : 1;
			uint16_t rsvd : 1;
			uint16_t vender_specific_error_status : 4;
		} bm;
	} error_interrupt_status;
//	uint16_t normal_interrupt_status_enable;
	union{
		uint16_t word;
		struct {
			uint16_t command_complete : 1;
			uint16_t transfer_complete : 1;
			uint16_t block_gap_event : 1;
			uint16_t dma_interrupt : 1;
			uint16_t buffer_write_ready : 1;
			uint16_t buffer_read_ready : 1;
			uint16_t card_insertion : 1;
			uint16_t card_removeal : 1;
			uint16_t card_interrupt : 1;
			uint16_t int_a : 1;
			uint16_t int_b : 1;
			uint16_t int_c : 1;
			uint16_t re_turning_event : 1;
			uint16_t rsvd : 3;
		} bm;
	} normal_interrupt_status_enable;
//	uint16_t error_interrupt_status_enbale;
	union{
		uint16_t word;
		struct {
			uint16_t command_timeout_error : 1;
			uint16_t command_crc_error : 1;
			uint16_t command_end_bit_error : 1;
			uint16_t command_index_error : 1;
			uint16_t data_timeout_error : 1;
			uint16_t data_crc_error : 1;
			uint16_t data_end_bit_error : 1;
			uint16_t current_limit_error : 1;
			uint16_t auto_cmd12_error : 1;
			uint16_t adma_error : 1;
			uint16_t tuning_error : 1;
			uint16_t rsvd : 1;
			uint16_t vender_specific_error_status : 4;
		} bm;
	} error_interrupt_status_enbale;
//	uint16_t normal_interrupt_signal_enable;
	union{
		uint16_t word;
		struct {
			uint16_t command_complete : 1;
			uint16_t transfer_complete : 1;
			uint16_t block_gap_event : 1;
			uint16_t dma_interrupt : 1;
			uint16_t buffer_write_ready : 1;
			uint16_t buffer_read_ready : 1;
			uint16_t card_insertion : 1;
			uint16_t card_removeal : 1;
			uint16_t card_interrupt : 1;
			uint16_t int_a : 1;
			uint16_t int_b : 1;
			uint16_t int_c : 1;
			uint16_t re_turning_event : 1;
			uint16_t rsvd : 3;
		} bm;
	} normal_interrupt_signal_enable;
//	uint16_t error_interrupt_signal_enable;
	union{
		uint16_t word;
		struct {
			uint16_t command_timeout_error : 1;
			uint16_t command_crc_error : 1;
			uint16_t command_end_bit_error : 1;
			uint16_t command_index_error : 1;
			uint16_t data_timeout_error : 1;
			uint16_t data_crc_error : 1;
			uint16_t data_end_bit_error : 1;
			uint16_t current_limit_error : 1;
			uint16_t auto_cmd12_error : 1;
			uint16_t adma_error : 1;
			uint16_t tuning_error : 1;
			uint16_t rsvd : 1;
			uint16_t vender_specific_error_status : 4;
		} bm;
	} error_interrupt_signal_enable;
//	uint16_t auto_cmd_error_status;
	union{
		uint16_t word;
		struct {
			uint16_t auto_cmd12_not_executed : 1;
			uint16_t auto_cmd_timeout_error : 1;
			uint16_t auto_cmd_crc_error : 1;
			uint16_t auto_cmd_end_bit_error : 1;
			uint16_t auto_cmd_index_error : 1;
			uint16_t rsvd : 2;
			uint16_t command_not_issued_by_auto_cmd12_error : 1;
			uint16_t rsvd2 : 8;
		} bm;
	} auto_cmd_error_status;
//	uint16_t host_control2;
	union{
		uint16_t word;
		struct {
			uint16_t uhs_mode_select : 3;
			uint16_t _1_8v_signaling_enable : 1;
			uint16_t drive_strength_select : 2;
			uint16_t execute_tuning : 1;
			uint16_t sampling_clock_select : 1;
			uint16_t rsvd : 6;
			uint16_t asynchronous_interrupt_enable : 1;
			uint16_t preset_value_enable : 1;
		} bm;
	} host_control2;
//	uint16_t capabilities[4];
	union{
		uint64_t qword;
		struct {
			uint32_t timout_clock_frequency : 6;
			uint32_t rsvd : 1;
			uint32_t timeout_clock_unit : 1;
			uint32_t base_clock_frequency_for_sd_clock : 8;
			uint32_t max_block_length : 2;
			uint32_t _8bit_support_for_embeddded_device : 1;
			uint32_t adma2_support : 1;
			uint32_t rsvd2: 1;
			uint32_t high_speed_support : 1;
			uint32_t sdma_support : 1;
			uint32_t suspend_resume_support : 1;
			uint32_t voltage_support_3v3 : 1;
			uint32_t voltage_support_3v : 1;
			uint32_t voltage_support_1v8 : 1;
			uint32_t rsvd3 : 1;
			uint32_t _64bit_system_bus_support : 1;
			uint32_t asynchronous_interrupt_support : 1;
			uint32_t slot_type : 2;
			uint32_t sdr50_support : 1;
			uint32_t sdr104_support : 1;
			uint32_t ddr50_support : 1;
			uint32_t rsvd4 : 1;
			uint32_t driver_type_a_support : 1;
			uint32_t driver_type_b_support : 1;
			uint32_t driver_type_c_support : 1;
			uint32_t rsvd5 : 1;
			uint32_t timer_count_for_re_tuning : 4;
			uint32_t rsvd6 : 1;
			uint32_t use_tuning_for_sdr50 : 1;
			uint32_t re_tuning_modes : 2;
			uint32_t clock_multiplier : 8;
			uint32_t rsvd7 : 8;
		} bm;
	} capabilities;
//	uint16_t maximum_current_capabilities[4];
	union{
		uint64_t qword;
		struct {
			uint32_t maximun_current_for_3v3 : 8;
			uint32_t maximun_current_for_3v  : 8;
			uint32_t maximun_current_for_1v8 : 8;
			uint32_t rsvd  : 8;
			uint32_t rsvd2 : 32;
		} bm;
	} maximum_current_capabilities;
//	uint16_t force_event_for_auto_cmd_error_status;
	union{
		uint16_t word;
		struct {
			uint16_t force_event_for_auto_cmd12_not_executed : 1;
			uint16_t force_event_for_auto_cmd_timeout_error : 1;
			uint16_t force_event_for_auto_cmd_crc_error : 1;
			uint16_t force_event_for_auto_cmd_end_bit_error : 1;
			uint16_t force_event_for_auto_cmd_index_error : 1;
			uint16_t rsvd : 2;
			uint16_t force_event_for_command_not_issued_by_auto_cmd12_error : 1;
			uint16_t rsvd2 : 8;
		} bm;
	} force_event_for_auto_cmd_error_status;
//	uint16_t force_event_for_error_interrupt_status;
	union{
		uint16_t word;
		struct {
			uint16_t force_event_for_command_timeout_error : 1;
			uint16_t force_event_for_command_crc_error : 1;
			uint16_t force_event_for_command_end_bit_error : 1;
			uint16_t force_event_for_command_index_error : 1;
			uint16_t force_event_for_data_timeout_error : 1;
			uint16_t force_event_for_data_crc_error : 1;
			uint16_t force_event_for_data_end_bit_error : 1;
			uint16_t force_event_for_current_limit_error : 1;
			uint16_t force_event_for_auto_cmd_error : 1;
			uint16_t force_event_for_adma_error : 1;
			uint16_t rsvd : 2;
			uint16_t force_event_for_vendor_specific_error_status : 4;
		}bm;
	} force_event_for_error_interrupt_status;
//	uint8_t  adma_error_status;
	union{
		uint8_t byte;
		struct {
			uint8_t adma_error_state : 2;
			uint8_t adma_length_mismatch_error : 1;
			uint8_t rsvd : 5;
		} bm;
	} adma_error_status;
	uint8_t  reserved[3];
	uint64_t adma_system_address;
//	uint16_t preset_value[8];
	union {
		uint16_t word;
		struct {
			uint16_t sdclk_frequency_select_value : 10;
			uint16_t clock_generator_select_value : 1;
			uint16_t rsvd : 3;
			uint16_t driver_strength_select_value : 2;
		} bm;
	} preset_value[8];
	/* 0x70 - 0xDF */
	uint8_t  reserved2[0xE0 - 0x70];
//	uint32_t shared_bus_control;
	union{
		uint32_t dword;
		struct {
			uint32_t number_of_clock_pins : 3;
			uint32_t rsvd : 1;
			uint32_t number_of_interrupt_input_pins : 2;
			uint32_t rsvd2 : 2;
			uint32_t bus_width_preset : 7;
			uint32_t rsvd3 : 1;
			uint32_t clock_pin_select : 3;
			uint32_t rsvd4 : 1;
			uint32_t interrupt_pin_select : 3;
			uint32_t rsvd5 : 1;
			uint32_t back_end_power_control : 7;
			uint32_t rsvd6 : 1;
		} bm;
	} shared_bus_control;
	/* 0xE4 - 0xFB */
	uint8_t  reserved3[0xFC - 0xE4];
	uint16_t slot_interrupt_status;
//	uint16_t host_controller_version;
	union {
		uint16_t word;
		struct {
			uint8_t specificatoin_version_number;
			uint8_t vender_version_number;
		} bm;
	} host_controller_version;
} SdHostControllerRegs;

/* ちょっと自信ない */
typedef struct Adma_descripter_t
{
	uint32_t address;
	uint16_t length;
	uint8_t  rsv;
	uint8_t  attribute;
} Adma_desceipter;


typedef enum SAMD51_SDHC_t
{
	SAMD51_SDHC0 = 0x45000000UL,
	SAMD51_SDHC1 = 0x46000000UL,	
} SAMD51_SDHC;

typedef enum SAMD51_SDHC_BUS_VOLTAGE_t
{
	SAMD51_SDHC_BUS_3V3 = (0x7),
	SAMD51_SDHC_BUS_3V  = (0x6),
	SAMD51_SDHC_BUS_1V8 = (0x5)
} SAMD51_SDHC_BUS_VOLTAGE;

typedef enum SAMD51_SDHC_BUS_WIDTH_t
{
	SAMD51_SDHC_BUS_1BIT = 0,
	SAMD51_SDHC_BUS_4BIT = 2	
} SAMD51_SDHC_BUS_WIDTH;


typedef enum SAMD51_SDHC_AUTO_CMD_ENABLE_t
{
	SAMD51_SDHC_AUTO_CMD_DISABLED = 0,
	SAMD51_SDHC_AUTO_CMD12 = 1,
	SAMD51_SDHC_AUTO_CMD23 = 2,
	SAMD51_SDHC_AUTO_CMD_RSVD = 3	
} SAMD51_SDHC_AUTO_CMD_ENABLE;

//----------------------------------------------------------------------------
//----------------------------------------------------------------------------
//							    Abbreviation			Resp
// Basic Command (class 0)
#define CMD0			(0)	 // GOTO_IDLE_STATE			-
#define CMD1			(1)	 // SEND_OP_COND			R3
#define CMD2			(2)	 // ALL_SEND_CID			R2
#define CMD3			(3)  // SEND RELATIVE ADDR		R6
#define CMD4			(4)  // SET DSR					-
#define CMD6			(6)  // SWITCH FUNC				R1
#define CMD7			(7)  // SELECT/DESELECT CARD	R1b
#define CMD8			(8)  // SEND IF COND			R7
#define CMD9			(9)  // SEND CSD				R2
#define CMD10			(10) // SEND_CID				R2
#define CMD11			(11) // VOLTAGE SWITCH			R1
#define CMD12			(12) // STOP_TRANSMISSION		R1b
#define CMD13			(13) // SEND_STATUS				R1
#define CMD15			(15) // GO_INACTIVE_STATE		-

// Block Oriented Read Command (Class 2)
#define CMD16			(16) // SET_BLOCKLEN			R1
#define CMD17			(17) // READ_SINGLE_BLOCK		R1
#define CMD18			(18) // READ_MULTIPLE_BLOCK		R1
#define CMD19			(19) // SEND_TUNING_BLOCK		R1
#define CMD20			(20) // SPEED CLASS CONTROL		R1b
#define CMD23			(23) // SET_BLOCK_COUNT			R1

// Block Oriented Write Command (class 4)
//#define CMD16			(16) // SET_BLOCKLEN			R1
//#define CMD20			(20) // SPEED CLASS CONTROL		R1b
//#define CMD23			(23) // SET_BLOCK_COUNT			R1
#define CMD24			(24) // WRITE_BLOCK				R1
#define CMD25			(25) // WRITE MULTIPLE BLOCK	R1
#define CMD27			(27) // PROGRAM CSD				R1

// Block Oriented Write Protection Command (class 6)
#define CMD28			(28) // SET_WRITE_PROT			R1b
#define CMD29			(29) // CLR WRITE PROT			R1b
#define CMD30			(30) // SEND WRITE PROT			R1

