aks3g/ai_mini_4wd_kit/src/library/include/samd51_sdhc.h
// Erase Command (class 5)
#define CMD32			(32) // ERASE_WR_BLK_START		R1
#define CMD33			(33) // ERASE_WR_BLK_END		R1
#define CMD38			(38) // ERASE					R1b

// Lock Card (class 7)
//#define CMD16			(16) // SET_BLOCKLEN			R1
#define CMD41			(41) // LOCK UNLOCK				R1

// Application Specific Command (class 8)
#define CMD55			(55) // APP CMD					R1
#define CMD56			(56) // GEN CMD					R1

// Application Specific Commands used/reserved by SD Memory Card
#define ACMD6			(6)  // SET BUS WIDTH			R1
#define ACMD13			(13) // SD STATUS				R1
#define ACMD22			(22) // SEND NUM WR BLOCKS		R1
#define ACMD23			(23) // SET WR BLK ERASE COUNT	R1
#define ACMD41			(41) // SD SEND OP COND			R3
#define ACMD42			(42) // SET CLR CARD DETECT		R1
#define ACMD51			(51) // SEND SCR				R1

#define CMD_INDEX(x)			((x) << 8)
#define CMD_TYPE(t)				((t) << 6)
#define CMD_DATA_PRESENT(b)		((b) << 5)
#define CMD_IDX_CHECK(e)		((e) << 4)
#define CMD_CRC_CHECK(e)		((e) << 3)
#define CMD_RESP_TYPE(r)		((r) << 0)

#define NO_R					(CMD_IDX_CHECK(0) | CMD_CRC_CHECK(0) | CMD_RESP_TYPE(0))
#define R1						(CMD_IDX_CHECK(1) | CMD_CRC_CHECK(1) | CMD_RESP_TYPE(2))
#define R1b						(CMD_IDX_CHECK(1) | CMD_CRC_CHECK(1) | CMD_RESP_TYPE(3))
#define R2						(CMD_IDX_CHECK(0) | CMD_CRC_CHECK(1) | CMD_RESP_TYPE(1))
#define R3						(CMD_IDX_CHECK(0) | CMD_CRC_CHECK(0) | CMD_RESP_TYPE(2))
#define R4						(CMD_IDX_CHECK(0) | CMD_CRC_CHECK(0) | CMD_RESP_TYPE(2))
#define R5						(CMD_IDX_CHECK(1) | CMD_CRC_CHECK(1) | CMD_RESP_TYPE(2))
#define R5b						(CMD_IDX_CHECK(1) | CMD_CRC_CHECK(1) | CMD_RESP_TYPE(3))
#define R6						(CMD_IDX_CHECK(1) | CMD_CRC_CHECK(1) | CMD_RESP_TYPE(2))
#define R7						(CMD_IDX_CHECK(1) | CMD_CRC_CHECK(1) | CMD_RESP_TYPE(2))

#define SDHC_CMD0				(CMD_INDEX(CMD0)  | CMD_DATA_PRESENT(0) | NO_R)
#define SDHC_CMD1				(CMD_INDEX(CMD1)  | CMD_DATA_PRESENT(0) | R3)
#define SDHC_CMD2				(CMD_INDEX(CMD2)  | CMD_DATA_PRESENT(0) | R2)
#define SDHC_CMD3				(CMD_INDEX(CMD3)  | CMD_DATA_PRESENT(0) | R6)
#define SDHC_CMD4				(CMD_INDEX(CMD4)  | CMD_DATA_PRESENT(0) | NO_R)
#define SDHC_CMD6				(CMD_INDEX(CMD6)  | CMD_DATA_PRESENT(1) | R1)
#define SDHC_CMD7				(CMD_INDEX(CMD7)  | CMD_DATA_PRESENT(0) | R1b)
#define SDHC_CMD8				(CMD_INDEX(CMD8)  | CMD_DATA_PRESENT(0) | R7)
#define SDHC_CMD9				(CMD_INDEX(CMD9)  | CMD_DATA_PRESENT(0) | R2)
#define SDHC_CMD10				(CMD_INDEX(CMD10) | CMD_DATA_PRESENT(0) | R2)
#define SDHC_CMD11				(CMD_INDEX(CMD11) | CMD_DATA_PRESENT(0) | R1)
#define SDHC_CMD12				(CMD_INDEX(CMD12) | CMD_DATA_PRESENT(0) | R1b)
#define SDHC_CMD13				(CMD_INDEX(CMD13) | CMD_DATA_PRESENT(0) | R1)
#define SDHC_CMD15				(CMD_INDEX(CMD15) | CMD_DATA_PRESENT(0) | NO_R)
#define SDHC_CMD16				(CMD_INDEX(CMD16) | CMD_DATA_PRESENT(0) | R1)
#define SDHC_CMD17				(CMD_INDEX(CMD17) | CMD_DATA_PRESENT(1) | R1)
#define SDHC_CMD18				(CMD_INDEX(CMD18) | CMD_DATA_PRESENT(1) | R1)
#define SDHC_CMD19				(CMD_INDEX(CMD19) | CMD_DATA_PRESENT(1) | R1)
#define SDHC_CMD20				(CMD_INDEX(CMD20) | CMD_DATA_PRESENT(0) | R1b)
#define SDHC_CMD23				(CMD_INDEX(CMD23) | CMD_DATA_PRESENT(0) | R1)
#define SDHC_CMD24				(CMD_INDEX(CMD24) | CMD_DATA_PRESENT(1) | R1)
#define SDHC_CMD25				(CMD_INDEX(CMD25) | CMD_DATA_PRESENT(1) | R1)
#define SDHC_CMD27				(CMD_INDEX(CMD27) | CMD_DATA_PRESENT(1) | R1)
#define SDHC_CMD28				(CMD_INDEX(CMD28) | CMD_DATA_PRESENT(0) | R1b)
#define SDHC_CMD29				(CMD_INDEX(CMD29) | CMD_DATA_PRESENT(0) | R1b)
#define SDHC_CMD30				(CMD_INDEX(CMD30) | CMD_DATA_PRESENT(1) | R1)
#define SDHC_CMD32				(CMD_INDEX(CMD32) | CMD_DATA_PRESENT(0) | R1)
#define SDHC_CMD33				(CMD_INDEX(CMD33) | CMD_DATA_PRESENT(0) | R1)
#define SDHC_CMD38				(CMD_INDEX(CMD38) | CMD_DATA_PRESENT(0) | R1b)
#define SDHC_CMD42				(CMD_INDEX(CMD42) | CMD_DATA_PRESENT(1) | R1)
#define SDHC_CMD55				(CMD_INDEX(CMD55) | CMD_DATA_PRESENT(0) | R1)
#define SDHC_CMD56				(CMD_INDEX(CMD56) | CMD_DATA_PRESENT(1) | R1)

#define SDHC_ACMD6				(CMD_INDEX(ACMD6) | CMD_DATA_PRESENT(0) | R1)
#define SDHC_ACMD13				(CMD_INDEX(ACMD13)| CMD_DATA_PRESENT(1) | R1)
#define SDHC_ACMD22				(CMD_INDEX(ACMD22)| CMD_DATA_PRESENT(1) | R1)
#define SDHC_ACMD23				(CMD_INDEX(ACMD23)| CMD_DATA_PRESENT(0) | R1)
#define SDHC_ACMD41				(CMD_INDEX(ACMD41)| CMD_DATA_PRESENT(0) | R3)
#define SDHC_ACMD42				(CMD_INDEX(ACMD42)| CMD_DATA_PRESENT(0) | R1)
#define SDHC_ACMD51				(CMD_INDEX(ACMD51)| CMD_DATA_PRESENT(1) | R1)


//----------------------------------------------------------------------------
//----------------------------------------------------------------------------
#pragma pack(1)
typedef union ArgCmd4_t
{
	uint32_t dword;
	struct {
		uint16_t rsvd;
		uint16_t dsr;
	} bm;
} ArgCmd4;

#pragma pack(1)
typedef union ArgCmd7_t
{
	uint32_t dword;
	struct {
		uint16_t rsvd;
		uint16_t rca;
	} bm;
} ArgCmd7;

#pragma pack(1)
typedef union ArgCmd8_t
{
	uint32_t dword;
	struct {
		uint32_t pattern : 8;
		uint32_t supply_voltage : 4;
		uint32_t rsvd:20;
	} bm;
} ArgCmd8;

#pragma pack(1)
typedef union ArgCmd9_t
{
	uint32_t dword;
	struct {
		uint16_t rsvd;
		uint16_t rca;
	} bm;
} ArgCmd9;

#pragma pack(1)
typedef union ArgCmd10_t
{
	uint32_t dword;
	struct {
		uint16_t rsvd;
		uint16_t rca;
	} bm;
} ArgCmd10;

#pragma pack(1)
typedef union ArgCmd13_t
{
	uint32_t dword;
	struct {
		uint16_t rsvd;
		uint16_t rca;
	} bm;
} ArgCmd13;

#pragma pack(1)
typedef union ArgCmd15_t
{
	uint32_t dword;
	struct {
		uint16_t rsvd;
		uint16_t rca;
	} bm;
} ArgCmd15;

#pragma pack(1)
typedef union ArgCmd16_t
{
	uint32_t dword;
	uint32_t block_length;
} ArgCmd16;

#pragma pack(1)
typedef union ArgCmd17_t
{
	uint32_t dword;
	uint32_t data_address;
} ArgCmd17;

#pragma pack(1)
typedef union ArgCmd18_t
{
	uint32_t dword;
	uint32_t data_address;
} ArgCmd18;

#pragma pack(1)
typedef union ArgCmd20_t
{
	uint32_t dword;
	struct {
		uint32_t rsvd : 28;
		uint32_t speed_class_control : 4;
	} bm;
} ArgCmd20;

#pragma pack(1)
typedef union ArgCmd23_t
{
	uint32_t dword;
	uint32_t block_count;
} ArgCmd23;

#pragma pack(1)
typedef union ArgCmd24_t
{
	uint32_t dword;
	uint32_t data_address;
} ArgCmd24;

#pragma pack(1)
typedef union ArgCmd25_t
{
	uint32_t dword;
	uint32_t data_address;
} ArgCmd25;

#pragma pack(1)
typedef union ArgCmd28_t
{
	uint32_t dword;
	uint32_t data_address;
} ArgCmd28;

#pragma pack(1)
typedef union ArgCmd29_t
{
	uint32_t dword;
	uint32_t data_address;
} ArgCmd29;

#pragma pack(1)
typedef union ArgCmd30_t
{
	uint32_t dword;
	uint32_t write_protect_data_address;
} ArgCmd30;

#pragma pack(1)
typedef union ArgCmd32_t
{
	uint32_t dword;
	uint32_t data_address;
} ArgCmd32;

#pragma pack(1)
typedef union ArgCmd33_t
{
	uint32_t dword;
	uint32_t data_address;
} ArgCmd33;

#pragma pack(1)
typedef union ArgCmd55_t
{
	uint32_t dword;
	struct {
		uint16_t rsvd;
		uint16_t rca;
	} bm;
} ArgCmd55;

#pragma pack(1)
typedef union ArgCmd56_t
{
	uint32_t dword;
	struct {
		uint32_t rd_wr : 1;
		uint32_t rsvd : 31;
	} bm;
} ArgCmd56;

#pragma pack(1)
typedef union ArgAcmd6_t
{
	uint32_t dword;
	struct {
		uint32_t bus_width : 2;
		uint32_t rsvd : 30;
	} bm;
} ArgAcmd6;

#pragma pack(1)
typedef union ArgAcmd23_t
{
	uint32_t dword;
	struct {
		uint32_t number_of_blocks : 23;
		uint32_t rsvd : 9;
	} bm;
} ArgAcmd23;

#pragma pack(1)
typedef union ArgAcmd41_t
{
	uint32_t dword;
	struct {
		uint32_t rsvd0 : 8;
		uint32_t ocr : 16;
		uint32_t s18r : 1;
		uint32_t rsvd : 3;
		uint32_t xpc : 1;
		uint32_t rsvd2 : 1;
		uint32_t hcs : 1;
		uint32_t rsvd3 : 1;
	} bm;
} ArgAcmd41;

#pragma pack(1)
typedef union ArgCmd42_t
{
	uint32_t dword;
	struct {
		uint32_t set_cd : 1;
		uint32_t rsvd : 31;
	} bm;
} ArgCmd42;




//----------------------------------------------------------------------------
//----------------------------------------------------------------------------
#pragma pack(1)
typedef union SdcOcrReg_t
{
	uint32_t dword;
	struct {
		uint32_t rsvd : 15;
		uint32_t voltage_window : 9;
		uint32_t s18a : 1;
		uint32_t rsvd2 : 5;
		uint32_t card_capacity_status : 1;
		uint32_t busy : 1;
	} bm;
} SdcOcrReg;

#pragma pack(1)
typedef union SdcCidReg_t
{
	uint8_t array[16];
	struct {
		//		uint8_t unused : 1;
		//		uint8_t crc7 : 7;
		uint16_t manufacturing_date : 12;
		uint16_t rsvd : 4;
		uint32_t product_serial_number : 32;
		uint8_t product_revision : 8;
		uint8_t product_name[5];
		uint16_t oem_application_id;
		uint8_t manufacturer_id;
	} bm;
} SdcCidReg;

//----------------------------------------------------------------------------
//----------------------------------------------------------------------------
#pragma pack(1)
typedef union SdcCsdReg_t
{
	uint8_t array[16];
	struct {
		//		uint8_t unused : 1;
		//		uint8_t crc7 : 7;
		uint8_t rsvd : 2;
		uint8_t file_format : 2;
		uint8_t temporary_write_protection : 1;
		uint8_t permanent_write_protection : 1;
		uint8_t copy_flag : 1;
		uint8_t file_format_group : 1;
		uint8_t rsvd2 : 5;
		uint8_t oartial_blocks_for_write_allowed : 1;
		uint8_t max_write_data_block_length : 4;
		uint8_t write_speed_factor : 3;
		uint8_t rsvd3 : 2;
		uint8_t write_protect_group_enable : 1;
		uint8_t write_protect_group_size : 7;
		uint8_t erase_sector_size : 7;
		uint8_t erase_single_block_enable : 1;
		uint8_t device_size_multiplier : 3;
		uint8_t max_write_current_at_vdd_max : 3;
		uint8_t max_write_current_at_vdd_min : 3;
		uint8_t max_read_current_at_vdd_max : 3;
		uint8_t max_read_current_at_vdd_min : 3;
		uint16_t device_size : 12;
		uint8_t rsvd4 : 2;
		uint8_t dsr_implemented : 1;
		uint8_t read_block_misalignment : 1;
		uint8_t write_block_misalignment : 1;
		uint8_t partial_blocks_for_read_allowed : 1;
		uint8_t max_read_data_block_length : 4;
		uint16_t card_command_classs : 12;
		uint8_t max_data_transfer_rate : 8;
		uint8_t nsac : 8;
		uint8_t taac : 8;
		uint8_t rsvd5 : 6;
		uint8_t csd_structure : 2;
	} v1;
	struct {
		//		uint8_t unused : 1;
		//		uint8_t crc7 : 7;
		uint8_t rsvd : 2;
		uint8_t file_format : 2;
		uint8_t temporary_write_protection : 1;
		uint8_t permanent_write_protection : 1;
		uint8_t copy_flag : 1;
		uint8_t file_format_group : 1;
		uint8_t rsvd2 : 5;
		uint8_t oartial_blocks_for_write_allowed : 1;
		uint8_t max_write_data_block_length : 4;
		uint8_t write_speed_factor : 3;
		uint8_t rsvd3 : 2;
		uint8_t write_protect_group_enable : 1;
		uint8_t write_protect_group_size : 7;
		uint8_t erase_sector_size : 7;
		uint8_t erase_single_block_enable : 1;
		uint8_t rsvd4 : 1;
		uint32_t device_size : 22;
		uint8_t rsvd5 : 6;
		uint8_t dsr_implemented : 1;
		uint8_t read_block_misalignment : 1;
		uint8_t write_block_misalignment : 1;
		uint8_t partial_blocks_for_read_allowed : 1;
		uint8_t max_read_data_block_length : 4;
		uint16_t card_command_classs : 12;
		uint8_t max_data_transfer_rate : 8;
		uint8_t nsac : 8;
		uint8_t taac : 8;
		uint8_t rsvd6 : 6;
		uint8_t csd_structure : 2;
	} v2;
	struct {
		uint8_t  reserved4 : 1;
		uint8_t  _7bit_crc : 7;
		uint8_t  ecc_code : 2;
		uint8_t  file_format : 2;
		uint8_t  temporary_write_protection : 1;
		uint8_t  permanent_write_protection : 1;
		uint8_t  copy_flag_otp : 1;
		uint8_t  file_format_group : 1;
		uint8_t  reserved3 : 5;
		uint8_t  pararel_blocks_for_write_allowed : 1;
		uint8_t  max_write_data_block_length : 4;
		uint8_t  write_speed_factor : 3;
		uint8_t  manufacturer_default_ecc : 2;
		uint8_t  write_protect_group_enable : 1;
		uint8_t  write_protect_group_size : 5;
		uint8_t  erase_group_size_multplier : 5;
		uint8_t  erase_group_size : 5;
		uint8_t  devie_size_multiplier : 3;
		uint8_t  max_write_current_at_vdd_min : 3;
		uint8_t  max_write_current_at_vdd_max : 3;
		uint8_t  max_read_current_at_vdd_min : 3;
		uint8_t  max_read_current_at_vdd_max : 3;
		uint16_t device_size : 12;
		uint8_t  reserved2 : 2;
		uint8_t  dsr_implemented : 1;
		uint8_t  read_block_misalignment : 1;
		uint8_t  write_block_misalignement : 1;
		uint8_t  partial_blocks_for_read_allowed : 1;
		uint16_t max_read_data_block_length : 4;
		uint16_t card_command_class : 12;
		uint8_t  max_data_transfer_rate : 8;
		uint8_t  data_read_access_time2_in_clk : 8;
		uint8_t  data_read_access_time1 : 8;
		uint8_t  rserved : 2;
		uint8_t  spec_version : 4;
		uint8_t  signature : 2;
	} mmc;
} SdcCsdReg;


//----------------------------------------------------------------------------
//----------------------------------------------------------------------------
#pragma pack(1)
typedef union SdcR1_t
{
	uint32_t card_status;
	struct {
		uint32_t rsvd : 3;
		uint32_t ake_seq_error : 1;
		uint32_t rsvd2: 1;
		uint32_t app_cmd : 1;
		uint32_t rsvd3 : 1;
		uint32_t ready_for_data : 1;
		uint32_t current_state : 4;
		uint32_t erase_reset : 1;
		uint32_t card_ecc_disabled : 1;
		uint32_t wp_erase_skip : 1;
		uint32_t csd_overwrite : 1;
		uint32_t rsvd4 : 2;
		uint32_t error : 1;
		uint32_t cc_error : 1;
		uint32_t card_ecc_failed : 1;
		uint32_t illigal_command : 1;
		uint32_t com_crc_error : 1;
		uint32_t lock_unlock_failed : 1;
		uint32_t card_is_locked : 1;
		uint32_t wp_violation : 1;
		uint32_t erase_param : 1;
		uint32_t erase_seq_error : 1;
		uint32_t block_len_error : 1;
		uint32_t address_error : 1;
		uint32_t out_of_range : 1;
	};
} SdcR1;

#pragma pack(1)
typedef union SdcR2_t
{
	uint8_t bytes[16];
	SdcCsdReg csd;
	SdcCidReg cid;
} SdcR2;

#pragma pack(1)
typedef SdcOcrReg SdcR3;

#pragma pack(1)
typedef struct SdcR6_t
{
	uint16_t card_status;
	uint16_t new_published_rca;
} SdcR6;

#pragma pack(1)
typedef struct SdcR7_t
{
	uint8_t echo_back_of_check_platform : 8;
	uint8_t voltage_accepted : 4;
	uint32_t rsvd : 20;
} SdcR7;


//----------------------------------------------------------------------------
//----------------------------------------------------------------------------
#pragma pack(1)
typedef struct SdhcAdmaDescriptor_t
{
	uint16_t attr_valid : 1;
	uint16_t attr_end : 1;
	uint16_t attr_int : 1;
	uint16_t attr_zero : 1;
	uint16_t attr_act : 2;
	uint16_t reserved : 10;
	uint16_t length;
	uint32_t address;
} SdhcAdmaDescriptor;

