aks3g/ai_mini_4wd_kit/src/library/include/samd51_sdhc.h
typedef enum SAMD51_SDHC_CARD_TYPE_t
{
	SAMD51_SDHC_UNKNOWN = 0,
	SAMD51_SDHC_MMC = 1,
	SAMD51_SDHC_SDv1 = 2,
	SAMD51_SDHC_SDv2 = 3
} SAMD51_SDHC_CARD_TYPE;

#define SAMD51_SDHC_CARD_STATUS_NODISK		(0x00000001)
#define SAMD51_SDHC_CARD_STATUS_NOINIT		(0x00000002)

typedef struct Samd51_dhcCardContext_t
{
	uint32_t status;
	uint32_t rca;
	SAMD51_SDHC_CARD_TYPE type;
	int isBlockDevice;
	
	SdcCidReg cid;
	SdcCsdReg csd;
} Samd51_dhcCardContext;


//----------------------------------------------------------------------------
//----------------------------------------------------------------------------
typedef void (*Samd51SdhcTransactionDoneCallback)(int status, const void *resp, const size_t resp_len);
typedef void (*Samd51SdhcErrorCallback)(int error_code);


//----------------------------------------------------------------------------
int samd51_sdhc_initialize(SAMD51_SDHC sdhc);
int samd51_sdhc_get_host_controller_info(SAMD51_SDHC sdhc, char *info, size_t info_len);
int samd51_sdhc_get_host_controller_version(SAMD51_SDHC sdhc);

int samd51_sdhc_is_card_inserted(SAMD51_SDHC sdhc);

int samd51_sdhc_enable_sd_clock(SAMD51_SDHC sdhc, uint32_t BaseClock, uint32_t sdclkHz, int enable);
int samd51_sdhc_sd_bus_power_control(SAMD51_SDHC sdhc, SAMD51_SDHC_BUS_VOLTAGE bus_voltage);

int samd51_sdhc_send_cmd_blocing(SAMD51_SDHC sdhc, uint16_t cmd, uint32_t arg, void *resp, size_t resp_len);
int samd51_sdhc_send_cmd(SAMD51_SDHC sdhc, uint16_t cmd, uint32_t arg, Samd51SdhcTransactionDoneCallback cb);


int samd51_sdhc_card_initialization_and_identification(SAMD51_SDHC sdhc, Samd51_dhcCardContext *ctx);
int samd51_transfer(SAMD51_SDHC sdhc,  Samd51_dhcCardContext *ctx, int dir_read, uint32_t sector, void *buf, uint32_t length_byte, int blocking);

int samd51_sdhc_changing_bus_width(SAMD51_SDHC sdhc, uint16_t rca, SAMD51_SDHC_BUS_WIDTH bus_width);
int samd51_sdhc_timeout_setting_on_dat_line(SAMD51_SDHC sdhc, uint32_t timeout_us);

int samd51_sdhc_signal_voltage_switch(SAMD51_SDHC sdhc, SAMD51_SDHC_BUS_VOLTAGE voltage);

#endif/*SAMD51_SDHC_H_*/
